_Rarzrabotki/Rarus/USO2/InformationRegisters/уатАгрегатыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>уатАгрегатыТС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипАгрегата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МодельАгрегата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМоделиАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Comment>Первоначальная стоимость агрегата</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта первоначальной стоимости</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоЭксплуатации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроизводстваШины</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокСлужбыШины</Name>
					<Comment>Срок службы, мес.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УзелОбъектаЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьТипАгрегата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УзлыОбъектовЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УзлыОбъектовЭксплуатации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ОбъектыЭксплуатации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассыОбъектовЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подкласс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодклассыОбъектовЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбъектовЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВлияетНаДоступностьРЦ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РемонтирующееПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расположение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принадлежность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыУчетаНаработок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПоказательНаработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиНаработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначенныйРесурс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
								<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СмещениеЗначения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonModules/уатНастройкиШаблонов/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с шаблонами наименований.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция предназначена для формирования наименования по заданному шаблону.
//
// Параметры:
//  ВидОбъекта    - вид заполняемого объекта.
//  ДанныеОбъекта - данные для подстановки.
// 
// Возвращаемое значение:
//   - результат подстановки.
//
Функция СформироватьНаименованиеПоШаблону(Знач ВидОбъекта, ДанныеОбъекта, ПользовательскийШаблон=Неопределено) Экспорт
	
	ХранилищеШаблонов = Константы.уатНастройкиШаблонов.Получить();
	Если ХранилищеШаблонов = Неопределено Тогда 
		НастройкиШаблонов = Неопределено;
	Иначе 
		НастройкиШаблонов = ХранилищеШаблонов.Получить();
	КонецЕсли;
	
	Если НастройкиШаблонов = Неопределено Тогда 
		НастройкиШаблонов = Новый Структура();
	КонецЕсли;
	
	Если Не ПользовательскийШаблон = Неопределено Тогда 
		ТекстШаблона = ПользовательскийШаблон;
		
	ИначеЕсли НастройкиШаблонов.Свойство(ВидОбъекта) Тогда 
		ТекстШаблона = НастройкиШаблонов[ВидОбъекта];
		
	Иначе 
		ТекстШаблона = ПолучитьТекстШаблонаПоУмолчанию(ВидОбъекта);
	КонецЕсли;
	
	Если ВидОбъекта = "Справочник_ТранспортныеСредства" Тогда 
		Возврат ПодставитьПараметрыВШаблон_Справочник_ТранспортныеСредства(ТекстШаблона, ДанныеОбъекта);
		
	ИначеЕсли ВидОбъекта = "Справочник_уатПунктыНазначения" Тогда
		Возврат ПодставитьПараметрыВШаблон_Справочник_уатПунктыНазначения(ТекстШаблона, ДанныеОбъекта);
		
	ИначеЕсли ВидОбъекта = "Справочник_УзлыОбъектовЭксплуатации" Тогда
		Возврат ПодставитьПараметрыВШаблон_Справочник_УзлыОбъектовЭксплуатации(ТекстШаблона, ДанныеОбъекта);
		
	Иначе 
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Процедура заполняет реквизит формы "ДоступныеПараметры".
//
// Параметры:
//  Форма - управляемая форма.
//
Процедура ФормаНастройкиШаблонов_ЗаполнитьДоступныеПараметры(Форма) Экспорт
	
	ЗаполнитьДоступныеПараметры_Справочник_ТранспортныеСредства(Форма);
	ЗаполнитьДоступныеПараметры_Справочник_уатПунктыНазначения(Форма);
	ЗаполнитьДоступныеПараметры_Справочник_УзлыОбъектовЭксплуатации(Форма);
	
КонецПроцедуры

// Процедура заполняет реквизит формы "ТекстШаблона".
//
// Параметры:
//  Форма - управляемая форма.
//
Процедура ФормаНастройкиШаблонов_ЗаполнитьТекстШаблонов(Форма) Экспорт
	
	ХранилищеШаблонов = Константы.уатНастройкиШаблонов.Получить();
	Если ХранилищеШаблонов = Неопределено Тогда 
		НастройкиШаблонов = Неопределено;
	Иначе 
		НастройкиШаблонов = ХранилищеШаблонов.Получить();
	КонецЕсли;
	
	Если НастройкиШаблонов = Неопределено Тогда 
		НастройкиШаблонов = Новый Структура();
	КонецЕсли;
	
	Если НастройкиШаблонов.Свойство("Справочник_ТранспортныеСредства") Тогда 
		Форма.Справочник_ТранспортныеСредства_ТекстШаблона = НастройкиШаблонов.Справочник_ТранспортныеСредства;
	Иначе 
		Форма.Справочник_ТранспортныеСредства_ТекстШаблона = ПолучитьТекстШаблонаПоУмолчанию("Справочник_ТранспортныеСредства");
	КонецЕсли;
	
	Если НастройкиШаблонов.Свойство("Справочник_уатПунктыНазначения") Тогда 
		Форма.Справочник_уатПунктыНазначения_ТекстШаблона = НастройкиШаблонов.Справочник_уатПунктыНазначения;
	Иначе 
		Форма.Справочник_уатПунктыНазначения_ТекстШаблона = ПолучитьТекстШаблонаПоУмолчанию("Справочник_уатПунктыНазначения");
	КонецЕсли;
	
	Если НастройкиШаблонов.Свойство("Справочник_УзлыОбъектовЭксплуатации") Тогда 
		ДанныеШаблоновУзловОбъектовЭксплуатации = НастройкиШаблонов.Справочник_УзлыОбъектовЭксплуатации;
	Иначе 
		ДанныеШаблоновУзловОбъектовЭксплуатации = ПолучитьТекстШаблонаПоУмолчанию("Справочник_УзлыОбъектовЭксплуатации");
	КонецЕсли;
	
	Для Каждого ТекШаблон Из ДанныеШаблоновУзловОбъектовЭксплуатации Цикл 
		НовСтрока = Форма.Справочник_УзлыОбъектовЭксплуатации_ТекстыШаблонов.Добавить();
		НовСтрока.ТипАгрегата  = ТекШаблон.Ключ;
		НовСтрока.ТекстШаблона = ТекШаблон.Значение;
	КонецЦикла;
	
КонецПроцедуры

// Функция предназначена для получения текста шаблона указанного вида объекта.
//
// Параметры:
//  ВидОбъекта - вид заполняемого объекта.
// 
// Возвращаемое значение:
//   - текст шаблона.
//
Функция ПолучитьТекстШаблона(Знач ВидОбъекта) Экспорт
	
	ХранилищеШаблонов = Константы.уатНастройкиШаблонов.Получить();
	Если ХранилищеШаблонов = Неопределено Тогда 
		НастройкиШаблонов = Неопределено;
	Иначе 
		НастройкиШаблонов = ХранилищеШаблонов.Получить();
	КонецЕсли;
	
	Если НастройкиШаблонов = Неопределено Тогда 
		НастройкиШаблонов = Новый Структура();
	КонецЕсли;
	
	Если НастройкиШаблонов.Свойство(ВидОбъекта) Тогда 
		Возврат НастройкиШаблонов[ВидОбъекта];
		
	Иначе 
		Возврат ПолучитьТекстШаблонаПоУмолчанию(ВидОбъекта);
	КонецЕсли;
	
КонецФункции // ПолучитьТекстШаблона()

// Процедура записывает тексты шаблонов в константу.
//
// Параметры:
//  НастройкиШаблонов - структура - тексты шаблонов.
//
Процедура ЗаписатьТекстыШаблонов(НастройкиШаблонов) Экспорт
	
	Если Не ПравоДоступа("Изменение", Метаданные.Константы.уатНастройкиШаблонов) Тогда 
		Возврат;
	КонецЕсли;
	
	Константы.уатНастройкиШаблонов.Установить(Новый ХранилищеЗначения(НастройкиШаблонов, Новый СжатиеДанных(9)));
	
КонецПроцедуры

// Функция предназначена для получения текста шаблона по умолчанию для указанного вида объекта.
//
// Параметры:
//  ВидОбъекта - вид заполняемого объекта.
// 
// Возвращаемое значение:
//   - текст шаблона.
//
Функция ПолучитьТекстШаблонаПоУмолчанию(ВидОбъекта) Экспорт
	
	Если ВидОбъекта = "Справочник_ТранспортныеСредства" Тогда 
		Возврат "" + НСтр("ru = '[ГосНомер]'") + " " + НСтр("ru = '[Модель]'");
		
	ИначеЕсли ВидОбъекта = "Справочник_уатПунктыНазначения" Тогда 
		Возврат "" + НСтр("ru = '[Город]'") + " " + НСтр("ru = '[Улица]'") + " " + НСтр("ru = '[ДомСтроение]'");
		
	ИначеЕсли ВидОбъекта = "Справочник_УзлыОбъектовЭксплуатации" Тогда 
		ДанныеШаблоновУзловОбъектовЭксплуатации = Новый Соответствие();
		ДанныеШаблоновУзловОбъектовЭксплуатации.Вставить(Справочники.уатТипыАгрегатов.ПустаяСсылка(), "" + НСтр("ru = '[Модель]'") + " " + НСтр("ru = '[СерийныйНомер]'"));
		Возврат ДанныеШаблоновУзловОбъектовЭксплуатации;
		
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДоступныеПараметры_Справочник_ТранспортныеСредства(Форма)
	
	Форма.Справочник_ТранспортныеСредства_ДоступныеПараметры.Очистить();
	
	НовПараметр = Форма.Справочник_ТранспортныеСредства_ДоступныеПараметры.Добавить();
	НовПараметр.КлючПараметра = НСтр("ru = '[ГосНомер]'");   
	НовПараметр.Представление = НСтр("ru = 'Гос.номер'");
	
	НовПараметр = Форма.Справочник_ТранспортныеСредства_ДоступныеПараметры.Добавить();
	НовПараметр.КлючПараметра = НСтр("ru = '[ГарНомер]'");
	НовПараметр.Представление = НСтр("ru = 'Гар.номер'");
	
	НовПараметр = Форма.Справочник_ТранспортныеСредства_ДоступныеПараметры.Добавить();
	НовПараметр.КлючПараметра = НСтр("ru = '[Модель]'");
	НовПараметр.Представление = НСтр("ru = 'Модель'");
	
	НовПараметр = Форма.Справочник_ТранспортныеСредства_ДоступныеПараметры.Добавить();
	НовПараметр.КлючПараметра = НСтр("ru = '[ТипТС]'");
	НовПараметр.Представление = НСтр("ru = 'Тип ТС'");
	
	НовПараметр = Форма.Справочник_ТранспортныеСредства_ДоступныеПараметры.Добавить();
	НовПараметр.КлючПараметра = НСтр("ru = '[Гараж]'");
	НовПараметр.Представление = НСтр("ru = 'Гараж'");
	
	НовПараметр = Форма.Справочник_ТранспортныеСредства_ДоступныеПараметры.Добавить();
	НовПараметр.КлючПараметра = НСтр("ru = '[Организация]'");
	НовПараметр.Представление = НСтр("ru = 'Организация'");
	
	НовПараметр = Форма.Справочник_ТранспортныеСредства_ДоступныеПараметры.Добавить();
	НовПараметр.КлючПараметра = НСтр("ru = '[Подразделение]'");
	НовПараметр.Представление = НСтр("ru = 'Подразделение'");
	
	НовПараметр = Форма.Справочник_ТранспортныеСредства_ДоступныеПараметры.Добавить();
	НовПараметр.КлючПараметра = НСтр("ru = '[Колонна]'");
	НовПараметр.Представление = НСтр("ru = 'Колонна'");
	
КонецПроцедуры

Функция ПодставитьПараметрыВШаблон_Справочник_ТранспортныеСредства(Знач ТекстШаблона, ДанныеОбъекта)
	
	Результат = ТекстШаблона;
	
	Результат = СтрЗаменить(Результат, НСтр("ru = '[ГосНомер]'"), СокрЛП(Строка(ДанныеОбъекта.Код)));
	Результат = СтрЗаменить(Результат, НСтр("ru = '[ГарНомер]'"), СокрЛП(Строка(ДанныеОбъекта.уатГаражныйНомер)));
	Результат = СтрЗаменить(Результат, НСтр("ru = '[Модель]'"), СокрЛП(Строка(ДанныеОбъекта.уатМодель)));
	Результат = СтрЗаменить(Результат, НСтр("ru = '[ТипТС]'"), СокрЛП(Строка(ДанныеОбъекта.Тип)));
	Результат = СтрЗаменить(Результат, НСтр("ru = '[Гараж]'"), СокрЛП(Строка(ДанныеОбъекта.уатГараж)));
	Результат = СтрЗаменить(Результат, НСтр("ru = '[Организация]'"), СокрЛП(Строка(ДанныеОбъекта.уатОрганизация)));
	Результат = СтрЗаменить(Результат, НСтр("ru = '[Подразделение]'"), СокрЛП(Строка(ДанныеОбъекта.уатПодразделение)));
	Результат = СтрЗаменить(Результат, НСтр("ru = '[Колонна]'"), СокрЛП(Строка(ДанныеОбъекта.уатКолонна)));
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьДоступныеПараметры_Справочник_уатПунктыНазначения(Форма)
	
	Форма.Справочник_уатПунктыНазначения_ДоступныеПараметры.Очистить();
	
	НовПараметр = Форма.Справочник_уатПунктыНазначения_ДоступныеПараметры.Добавить();
	НовПараметр.КлючПараметра = НСтр("en = '[PointType]'; ru = '[ТипПункта]'");   
	НовПараметр.Представление = НСтр("en='Point type';ru='Тип пункта'");
	
	НовПараметр = Форма.Справочник_уатПунктыНазначения_ДоступныеПараметры.Добавить();
	НовПараметр.КлючПараметра = НСтр("en = '[Country]'; ru = '[Страна]'");   
	НовПараметр.Представление = НСтр("en='Country';ru='Страна'");
	
	НовПараметр = Форма.Справочник_уатПунктыНазначения_ДоступныеПараметры.Добавить();
	НовПараметр.КлючПараметра = НСтр("en = '[Index]'; ru = '[Индекс]'");   
	НовПараметр.Представление = НСтр("en='Index';ru='Индекс'");
	
	НовПараметр = Форма.Справочник_уатПунктыНазначения_ДоступныеПараметры.Добавить();
	НовПараметр.КлючПараметра = НСтр("en = '[Region]'; ru = '[Регион]'");   
	НовПараметр.Представление = НСтр("en='Region';ru='Регион'");
	
	НовПараметр = Форма.Справочник_уатПунктыНазначения_ДоступныеПараметры.Добавить();
	НовПараметр.КлючПараметра = НСтр("en = '[Okrug]'; ru = '[Округ]'");   
	НовПараметр.Представление = НСтр("en='Okrug';ru='Округ'");
	
	НовПараметр = Форма.Справочник_уатПунктыНазначения_ДоступныеПараметры.Добавить();
	НовПараметр.КлючПараметра = НСтр("en = '[District]'; ru = '[Район]'");   
	НовПараметр.Представление = НСтр("en='District';ru='Район'");
	
	НовПараметр = Форма.Справочник_уатПунктыНазначения_ДоступныеПараметры.Добавить();
	НовПараметр.КлючПараметра = НСтр("en = '[City]'; ru = '[Город]'");   
	НовПараметр.Представление = НСтр("en='City';ru='Город'");
	
	НовПараметр = Форма.Справочник_уатПунктыНазначения_ДоступныеПараметры.Добавить();
	НовПараметр.КлючПараметра = НСтр("en = '[UrbanArea]'; ru = '[ВнутригРайон]'");   
	НовПараметр.Представление = НСтр("en='Urban area';ru='Внутр. р-н.'");
	
	НовПараметр = Форма.Справочник_уатПунктыНазначения_ДоступныеПараметры.Добавить();
	НовПараметр.КлючПараметра = НСтр("en = '[Locality]'; ru = '[НаселенныйПункт]'");   
	НовПараметр.Представление = НСтр("en='Locality';ru='Нас. пункт'");
	
	НовПараметр = Форма.Справочник_уатПунктыНазначения_ДоступныеПараметры.Добавить();
	НовПараметр.КлючПараметра = НСтр("en = '[Street]'; ru = '[Улица]'");   
	НовПараметр.Представление = НСтр("en='Street';ru='Улица'");
	
	НовПараметр = Форма.Справочник_уатПунктыНазначения_ДоступныеПараметры.Добавить();
	НовПараметр.КлючПараметра = НСтр("en = '[Area]'; ru = '[Территория]'");   
	НовПараметр.Представление = НСтр("en='Area';ru='Территория'");
	
	НовПараметр = Форма.Справочник_уатПунктыНазначения_ДоступныеПараметры.Добавить();
	НовПараметр.КлючПараметра = НСтр("en = '[BuildingStructure]'; ru = '[ДомСтроение]'");   
	НовПараметр.Представление = НСтр("en='Building (structure)';ru='Дом (строение)'");
	
КонецПроцедуры

Функция ПодставитьПараметрыВШаблон_Справочник_уатПунктыНазначения(Знач ТекстШаблона, ДанныеОбъекта)
	
	ПараметрыЗаполнения = ПолучитьПараметрыЗаполненияСправочникУатПунктыНазначения(ДанныеОбъекта);
	
	Результат = ТекстШаблона;
	
	Результат = СтрЗаменить(Результат, НСтр("en = '[PointType]'; ru = '[ТипПункта]'"), ПараметрыЗаполнения.ТипПункта);
	Результат = СтрЗаменить(Результат, НСтр("en = '[Country]'; ru = '[Страна]'"), ПараметрыЗаполнения.Страна);
	Результат = СтрЗаменить(Результат, НСтр("en = '[Index]'; ru = '[Индекс]'"), ПараметрыЗаполнения.Индекс);
	Результат = СтрЗаменить(Результат, НСтр("en = '[Region]'; ru = '[Регион]'"), ПараметрыЗаполнения.Регион);
	Результат = СтрЗаменить(Результат, НСтр("en = '[Okrug]'; ru = '[Округ]'"), ПараметрыЗаполнения.Округ);
	Результат = СтрЗаменить(Результат, НСтр("en = '[District]'; ru = '[Район]'"), ПараметрыЗаполнения.Район);
	Результат = СтрЗаменить(Результат, НСтр("en = '[City]'; ru = '[Город]'"), ПараметрыЗаполнения.Город);
	Результат = СтрЗаменить(Результат, НСтр("en = '[UrbanArea]'; ru = '[ВнутригРайон]'"), ПараметрыЗаполнения.ВнутригРайон);
	Результат = СтрЗаменить(Результат, НСтр("en = '[Locality]'; ru = '[НаселенныйПункт]'"), ПараметрыЗаполнения.НаселенныйПункт);
	Результат = СтрЗаменить(Результат, НСтр("en = '[Street]'; ru = '[Улица]'"), ПараметрыЗаполнения.Улица);
	Результат = СтрЗаменить(Результат, НСтр("en = '[Area]'; ru = '[Территория]'"), ПараметрыЗаполнения.Территория);
	Результат = СтрЗаменить(Результат, НСтр("en = '[BuildingStructure]'; ru = '[ДомСтроение]'"), ПараметрыЗаполнения.ДомСтроение);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПараметрыЗаполненияСправочникУатПунктыНазначения(ДанныеОбъекта)
	
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("ТипПункта",       СокрЛП(Строка(ДанныеОбъекта.ТипПункта)));
	ПараметрыЗаполнения.Вставить("Страна",          СокрЛП(Строка(ДанныеОбъекта.Страна)));
	ПараметрыЗаполнения.Вставить("Индекс",          "");
	ПараметрыЗаполнения.Вставить("Регион",          "");
	ПараметрыЗаполнения.Вставить("Округ",           "");
	ПараметрыЗаполнения.Вставить("Район",           "");
	ПараметрыЗаполнения.Вставить("Город",           "");
	ПараметрыЗаполнения.Вставить("ВнутригРайон",    "");
	ПараметрыЗаполнения.Вставить("НаселенныйПункт", "");
	ПараметрыЗаполнения.Вставить("Улица",           "");
	ПараметрыЗаполнения.Вставить("Территория",      "");
	ПараметрыЗаполнения.Вставить("ДомСтроение",     "");
	
	JSONСтрокаКонтактнойИнформации = ДанныеОбъекта.ЗначениеАдреса;
	Если ЗначениеЗаполнено(JSONСтрокаКонтактнойИнформации) Тогда
		Возврат ПолучитьПараметрыЗаполненияСправочникУатПунктыНазначенияПоJSON(ПараметрыЗаполнения, JSONСтрокаКонтактнойИнформации);
	КонецЕсли;
	
	//{Совместимость}
	// Этот код - для совместимости с старым форматом хранения адреса в XML
	XMLСтрокаКонтактнойИнформации = ДанныеОбъекта.ЗначенияПолейАдреса.Получить();
	
	Если УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВXML(XMLСтрокаКонтактнойИнформации) Тогда 
		XDTOКонтактнойИнформации = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияИзXML(
			XMLСтрокаКонтактнойИнформации, 
			Перечисления.ТипыКонтактнойИнформации.Адрес
		);
		
	Иначе 
		XDTOКонтактнойИнформации = УправлениеКонтактнойИнформациейСлужебный.АдресXMLВXDTO(
			XMLСтрокаКонтактнойИнформации, 
			ДанныеОбъекта.Адрес
		);
	КонецЕсли;
	
	Если УправлениеКонтактнойИнформациейСлужебный.АдресВведенВСвободнойФорме(XDTOКонтактнойИнформации) Тогда 
		Возврат ПараметрыЗаполнения;
	КонецЕсли;
	
	СоставПолейКИ = XDTOКонтактнойИнформации.Состав.Состав;
	
	Если Не (ТипЗнч(СоставПолейКИ) = Тип("ОбъектXDTO") Или ТипЗнч(СоставПолейКИ) = Тип("Структура")) Тогда 
		Возврат ПараметрыЗаполнения;
	КонецЕсли;
	
	Если Не СоставПолейКИ.Город = Неопределено Тогда 
		ПараметрыЗаполнения.Вставить("Город", СоставПолейКИ.Город);
	КонецЕсли;
	
	Если Не СоставПолейКИ.НаселПункт = Неопределено Тогда 
		ПараметрыЗаполнения.Вставить("НаселенныйПункт", СоставПолейКИ.НаселПункт);
	КонецЕсли;
	
	Если Не СоставПолейКИ.ВнутригРайон = Неопределено Тогда 
		ПараметрыЗаполнения.Вставить("ВнутригРайон", СоставПолейКИ.ВнутригРайон);
	КонецЕсли;
	
	Если Не СоставПолейКИ.СвРайМО = Неопределено И Не СоставПолейКИ.СвРайМО.Район = Неопределено Тогда 
		ПараметрыЗаполнения.Вставить("Район", СоставПолейКИ.СвРайМО.Район);
	КонецЕсли;
	
	Если Не СоставПолейКИ.СубъектРФ = Неопределено Тогда 
		ПараметрыЗаполнения.Вставить("Регион", СоставПолейКИ.СубъектРФ);
	КонецЕсли;
	
	Если Не СоставПолейКИ.Округ = Неопределено Тогда 
		ПараметрыЗаполнения.Вставить("Округ", СоставПолейКИ.Округ);
	КонецЕсли;
	
	Если Не СоставПолейКИ.Улица = Неопределено Тогда 
		ПараметрыЗаполнения.Вставить("Улица", СоставПолейКИ.Улица);
	КонецЕсли;
	
	ДополнительныеПоляАдреса = ДополнительныеПоляАдреса(СоставПолейКИ);
	
	Индекс = ДополнительныеПоляАдреса.Получить("Почтовый индекс");
	Если Не Индекс = Неопределено Тогда 
		ПараметрыЗаполнения.Вставить("Индекс", Индекс);
	КонецЕсли;
	
	Территория = ДополнительныеПоляАдреса.Получить("Территория");
	Если Не Территория = Неопределено Тогда 
		ПараметрыЗаполнения.Вставить("Территория", Территория);
	КонецЕсли;
	
	Дом = ДополнительныеПоляАдреса.Получить("Дом");
	Строение = ДополнительныеПоляАдреса.Получить("Строение");
	Если Не Дом = Неопределено Тогда 
		ПараметрыЗаполнения.Вставить("ДомСтроение", Дом);
	ИначеЕсли Не Строение = Неопределено Тогда 
		ПараметрыЗаполнения.Вставить("ДомСтроение", Строение);
	КонецЕсли;
	
	Возврат ПараметрыЗаполнения;
	//{/Совместимость}
КонецФункции // ПолучитьПараметрыЗаполненияСправочникУатПунктыНазначения()

Функция ПолучитьПараметрыЗаполненияСправочникУатПунктыНазначенияПоJSON(ПараметрыЗаполнения, JSONСтрокаКонтактнойИнформации)
	Если Не УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВJSON(JSONСтрокаКонтактнойИнформации) Тогда
		Возврат ПараметрыЗаполнения;
	КонецЕсли;
	
	Если УправлениеКонтактнойИнформациейСлужебный.АдресВведенВСвободнойФорме(JSONСтрокаКонтактнойИнформации) Тогда 
		Возврат ПараметрыЗаполнения;
	КонецЕсли;
	
	СоставПолейКИ = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(JSONСтрокаКонтактнойИнформации,
		Перечисления.ТипыКонтактнойИнформации.Адрес);
	
	Если ЗначениеЗаполнено(СоставПолейКИ.city) Тогда 
		ПараметрыЗаполнения.Вставить("Город", СоставПолейКИ.city);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СоставПолейКИ.settlement) Тогда 
		ПараметрыЗаполнения.Вставить("НаселенныйПункт", СоставПолейКИ.settlement);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СоставПолейКИ.cityDistrict) Тогда 
		ПараметрыЗаполнения.Вставить("ВнутригРайон", СоставПолейКИ.cityDistrict);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СоставПолейКИ.district) Тогда 
		ПараметрыЗаполнения.Вставить("Район", СоставПолейКИ.district);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СоставПолейКИ.area) Тогда 
		ПараметрыЗаполнения.Вставить("Регион", СоставПолейКИ.area);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СоставПолейКИ.munDistrict) Тогда 
		ПараметрыЗаполнения.Вставить("Округ", СоставПолейКИ.munDistrict);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СоставПолейКИ.street) Тогда 
		ПараметрыЗаполнения.Вставить("Улица", СоставПолейКИ.street + " " + СоставПолейКИ.streetType);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СоставПолейКИ.ZIPcode) Тогда 
		ПараметрыЗаполнения.Вставить("Индекс", СоставПолейКИ.ZIPcode);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СоставПолейКИ.territory) Тогда 
		ПараметрыЗаполнения.Вставить("Территория", СоставПолейКИ.territory);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СоставПолейКИ.houseNumber) Тогда 
		ПараметрыЗаполнения.Вставить("ДомСтроение", СоставПолейКИ.houseNumber);
	ИначеЕсли ЗначениеЗаполнено(СоставПолейКИ.buildings) 
		И ТипЗнч(СоставПолейКИ.buildings) = Тип("Массив")
		И СоставПолейКИ.buildings.Количество() > 0 Тогда
		
		ПараметрыЗаполнения.Вставить("ДомСтроение", СоставПолейКИ.buildings[0].Number);
		
	КонецЕсли;
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

Функция ДополнительныеПоляАдреса(XDTOАдрес)
	
	ДополнительныеПоля = Новый Соответствие();
	
	Если XDTOАдрес.Свойства().Получить("ДопАдрЭл") = Неопределено Тогда
		Возврат ДополнительныеПоля;
	КонецЕсли;
	
	Для Каждого ДопЭлемент Из XDTOАдрес.ДопАдрЭл Цикл
		Если ДопЭлемент.ТипАдрЭл = Неопределено Тогда 
			Если ДопЭлемент.Номер = Неопределено Тогда 
				Продолжить;
			Иначе 
				ТипОбъекта = ТипОбъектаПоКодуСериализации(ДопЭлемент.Номер.Тип);
				ДополнительныеПоля.Вставить(ТипОбъекта.Наименование, ДопЭлемент.Номер.Значение);
			КонецЕсли;
		Иначе 
			ТипОбъекта = ТипОбъектаПоКодуСериализации(ДопЭлемент.ТипАдрЭл);
			ДополнительныеПоля.Вставить(ТипОбъекта.Наименование, ДопЭлемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДополнительныеПоля;
	
КонецФункции

Функция ТипОбъектаПоКодуСериализации(Код)
	
	Для Каждого Элемент Из ТипыОбъектовАдресацииАдресаРФ() Цикл
		Если Элемент.Код = Код Тогда
			Возврат Элемент;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ТипыОбъектовАдресацииАдресаРФ()
	
	Результат = Новый Массив;
	
	// Код, Наименование, Тип, Порядок, КодФИАС
	// Тип: 1 - владение, 2 - здание, 3 - помещение.
	
	Результат.Добавить(СтрокаОбъектаАдресации("1010", НСтр("ru='Дом';en='House'"),          1));
	Результат.Добавить(СтрокаОбъектаАдресации("1020", НСтр("ru='Владение';en='Ownership'"),     1));
	Результат.Добавить(СтрокаОбъектаАдресации("1030", НСтр("ru='Домовладение';en='Home-ownership'"), 1));
	
	Результат.Добавить(СтрокаОбъектаАдресации("1050", НСтр("ru='Корпус';en='Body'"),     2));
	Результат.Добавить(СтрокаОбъектаАдресации("1060", НСтр("ru='Строение';en='Construction'"),   2));
	Результат.Добавить(СтрокаОбъектаАдресации("1080", НСтр("ru='Литера';en='Letter'"),     2));
	Результат.Добавить(СтрокаОбъектаАдресации("1070", НСтр("ru='Сооружение';en='Facility'"), 2));
	Результат.Добавить(СтрокаОбъектаАдресации("1040", НСтр("ru='Участок';en='Land'"),    2));
	
	Результат.Добавить(СтрокаОбъектаАдресации("2010", НСтр("ru='Квартира';en='Apartment'"),  3));
	Результат.Добавить(СтрокаОбъектаАдресации("2030", НСтр("ru='Офис';en='Office'"),      3));
	Результат.Добавить(СтрокаОбъектаАдресации("2040", НСтр("ru='Бокс';en='Box'"),      3));
	Результат.Добавить(СтрокаОбъектаАдресации("2020", НСтр("ru='Помещение';en='Placement'"), 3));
	Результат.Добавить(СтрокаОбъектаАдресации("2050", НСтр("ru='Комната';en='Room'"),   3));
	Результат.Добавить(СтрокаОбъектаАдресации("2060", НСтр("ru='Этаж';en='Floor'"),      3));
	//  Наши сокращения для поддержки обратной совместимости при парсинге.
	Результат.Добавить(СтрокаОбъектаАдресации("2010", НСтр("ru='кв.';en='kw.'"),       3));
	Результат.Добавить(СтрокаОбъектаАдресации("2030", НСтр("ru='оф.';en='of.'"),       3));
	
	// Уточняющие объекты
	Результат.Добавить(СтрокаОбъектаАдресации("10100000", НСтр("ru='Почтовый индекс';en='Zip code'")));
	Результат.Добавить(СтрокаОбъектаАдресации("10200000", НСтр("ru='Адресная точка';en='Address point'")));
	Результат.Добавить(СтрокаОбъектаАдресации("10300000", НСтр("ru='Садовое товарищество';en=""Gardeners' partnership""")));
	Результат.Добавить(СтрокаОбъектаАдресации("10400000", НСтр("ru='Элемент улично-дорожной сети, планировочной структуры дополнительного адресного элемента';en='Item of street-road network, planning structure of additional address element'")));
	Результат.Добавить(СтрокаОбъектаАдресации("10500000", НСтр("ru='Промышленная зона';en='Industrial area'")));
	Результат.Добавить(СтрокаОбъектаАдресации("10600000", НСтр("ru='Гаражно-строительный кооператив';en='Garage construction co-operative'")));
	Результат.Добавить(СтрокаОбъектаАдресации("10700000", НСтр("ru='Территория';en='Area'")));
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаОбъектаАдресации(Код, Наименование, Тип = 0)
	
	СтруктураОбъектаАдресации = Новый Структура;
	СтруктураОбъектаАдресации.Вставить("Код",          Код);
	СтруктураОбъектаАдресации.Вставить("Наименование", Наименование);
	СтруктураОбъектаАдресации.Вставить("Тип",          Тип);
	СтруктураОбъектаАдресации.Вставить("Сокращение",   НРег(Наименование));
	
	Возврат СтруктураОбъектаАдресации;
	
КонецФункции

Процедура ЗаполнитьДоступныеПараметры_Справочник_УзлыОбъектовЭксплуатации(Форма)
	
	Форма.Справочник_УзлыОбъектовЭксплуатации_ДоступныеПараметры.Очистить();
	
	НовПараметр = Форма.Справочник_УзлыОбъектовЭксплуатации_ДоступныеПараметры.Добавить();
	НовПараметр.КлючПараметра = НСтр("ru = '[Модель]'");   
	НовПараметр.Представление = НСтр("ru = 'Модель'");
	
	НовПараметр = Форма.Справочник_УзлыОбъектовЭксплуатации_ДоступныеПараметры.Добавить();
	НовПараметр.КлючПараметра = НСтр("ru = '[СерийныйНомер]'");   
	НовПараметр.Представление = НСтр("ru = 'Серийный номер'");
	
	НовПараметр = Форма.Справочник_УзлыОбъектовЭксплуатации_ДоступныеПараметры.Добавить();
	НовПараметр.КлючПараметра = НСтр("ru = '[ТипАгрегата]'");   
	НовПараметр.Представление = НСтр("ru = 'Тип агрегата'");
	
	Если Форма.Справочник_УзлыОбъектовЭксплуатации_ТипАгрегата = Справочники.уатТипыАгрегатов.Шина Тогда 
		НовПараметр = Форма.Справочник_УзлыОбъектовЭксплуатации_ДоступныеПараметры.Добавить();
		НовПараметр.КлючПараметра = НСтр("ru = '[СрокСлужбыШины]'");   
		НовПараметр.Представление = НСтр("ru = 'Срок службы шины'");
		
	Иначе 
		НовПараметр = Форма.Справочник_УзлыОбъектовЭксплуатации_ДоступныеПараметры.Добавить();
		НовПараметр.КлючПараметра = НСтр("ru = '[ГоденДо]'");   
		НовПараметр.Представление = НСтр("ru = 'Годен до'");
	КонецЕсли;
	
КонецПроцедуры

Функция ПодставитьПараметрыВШаблон_Справочник_УзлыОбъектовЭксплуатации(Знач ТекстыШаблонов, ОбъектИсточник)
	
	Если ТипЗнч(ОбъектИсточник) = Тип("Структура") Тогда 
		ДанныеОбъекта = ОбъектИсточник;
	Иначе 
		ДанныеОбъекта = ПолучитьДанныеОбъектаУзлаОбъектаЭксплуатации(ОбъектИсточник);
	КонецЕсли;
	
	ТекстШаблонаПоТипу = ТекстыШаблонов.Получить(ДанныеОбъекта.ТипАгрегата);
	ТекстШаблонаОбщий  = ТекстыШаблонов.Получить(Справочники.уатТипыАгрегатов.ПустаяСсылка());
	
	Если ТекстШаблонаПоТипу = Неопределено Тогда 
		Результат = ТекстШаблонаОбщий;
	Иначе 
		Результат = ТекстШаблонаПоТипу;
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, НСтр("ru = '[Модель]'"), СокрЛП(Строка(ДанныеОбъекта.Модель)));
	Результат = СтрЗаменить(Результат, НСтр("ru = '[СерийныйНомер]'"), СокрЛП(Строка(ДанныеОбъекта.СерийныйНомер)));
	Результат = СтрЗаменить(Результат, НСтр("ru = '[ТипАгрегата]'"), СокрЛП(Строка(ДанныеОбъекта.ТипАгрегата)));
	
	Если ДанныеОбъекта.ТипАгрегата = Справочники.уатТипыАгрегатов.Шина Тогда 
		Результат = СтрЗаменить(Результат, НСтр("ru = '[СрокСлужбыШины]'"), Формат(ДанныеОбъекта.СрокСлужбыШины, "ЧЦ=2; ЧВН="));
		Результат = СтрЗаменить(Результат, НСтр("ru = '[ГоденДо]'"), "");
	Иначе 
		Результат = СтрЗаменить(Результат, НСтр("ru = '[СрокСлужбыШины]'"), "");
		Результат = СтрЗаменить(Результат, НСтр("ru = '[ГоденДо]'"), Формат(ДанныеОбъекта.ГоденДо, "ДФ=dd.MM.yyyy"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеОбъектаУзлаОбъектаЭксплуатации(ОбъектИсточник)
	
	ДанныеОбъекта = Новый Структура();
	ДанныеОбъекта.Вставить("Модель",         "");
	ДанныеОбъекта.Вставить("СерийныйНомер",  "");
	ДанныеОбъекта.Вставить("ТипАгрегата",    Справочники.уатТипыАгрегатов.ПустаяСсылка());
	ДанныеОбъекта.Вставить("СрокСлужбыШины", 0);
	ДанныеОбъекта.Вставить("ГоденДо",        '00010101');
	
	Запрос = Новый Запрос();
	
	Если ТипЗнч(ОбъектИсточник) = Тип("СправочникОбъект.УзлыОбъектовЭксплуатации") Тогда 
		Запрос.УстановитьПараметр("Ссылка", ОбъектИсточник.Ссылка);
	Иначе 
		Запрос.УстановитьПараметр("Ссылка", ОбъектИсточник);
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УзлыОбъектовЭксплуатации.Модель КАК Модель,
	|	УзлыОбъектовЭксплуатации.СерийныйНомер КАК СерийныйНомер,
	|	ЕСТЬNULL(уатАгрегатыТС.ТипАгрегата, ЗНАЧЕНИЕ(Справочник.уатТипыАгрегатов.ПустаяСсылка)) КАК ТипАгрегата,
	|	ЕСТЬNULL(уатАгрегатыТС.СрокСлужбыШины, 0) КАК СрокСлужбыШины,
	|	ЕСТЬNULL(уатАгрегатыТС.ГоденДо, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ГоденДо
	|ИЗ
	|	Справочник.УзлыОбъектовЭксплуатации КАК УзлыОбъектовЭксплуатации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатАгрегатыТС КАК уатАгрегатыТС
	|		ПО (уатАгрегатыТС.УзелОбъектаЭксплуатации = УзлыОбъектовЭксплуатации.Ссылка)
	|ГДЕ
	|	УзлыОбъектовЭксплуатации.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Выборка);
	КонецЕсли;
	
	Если ТипЗнч(ОбъектИсточник) = Тип("СправочникОбъект.УзлыОбъектовЭксплуатации") Тогда 
		ДанныеОбъекта.Модель        = ОбъектИсточник.Модель;
		ДанныеОбъекта.СерийныйНомер = ОбъектИсточник.СерийныйНомер;
	КонецЕсли;
	
	Возврат ДанныеОбъекта;
	
КонецФункции // ПолучитьДанныеОбъектаУзлаОбъектаЭксплуатации()

#КонецОбласти
